In [14]:
import numpy as np
import pandas as pd

# Shift+enter = 코드 실행 후 다음으로 넘어감.
# Ctrl+enter = 코드 실행

# 기본적으로 table은 list형태이다. 
# 함수나 변수, 파일을 불러올때는()

In [3]:
pd.Series()

Series([], dtype: float64)

In [5]:
ser1 = pd.Series([10,20,30])
ser1

0    10
1    20
2    30
dtype: int64

In [7]:
ser1.index=['a','b','c']
ser1

a    10
b    20
c    30
dtype: int64

In [5]:
ser2=pd.Series({'a':100,'b':200})
ser2

a    100
b    200
dtype: int64

In [6]:
ser3=pd.Series(data = [1,2], index = ['USA','GERMANY'])
ser3
# Pandas Series는 인덱스가 부여가 되기 때문에 index끼리 연산이 가능하다.

USA        1
GERMANY    2
dtype: int64

In [73]:
table1=pd.read_csv('C:/Users/Administrator/jupyter/netflix_titles.csv')
b= table1['Unnamed: 5'].fillna(value = 0)
table1.head()

,show_id,type,title,director,country,Unnamed: 5,release_year,rating,duration,listed_in,...,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25
0,81145628,Movie,Norm of the North: King Sized Adventure,"Richard Finn, Tim Maltby","United States, India, South Korea, China",NaN,2019,TV-PG,90 min,"Children & Family Movies, Comedies",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,80117401,Movie,Jandino: Whatever it Takes,NaN,United Kingdom,NaN,2016,TV-MA,94 min,Stand-Up Comedy,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,70234439,TV Show,Transformers Prime,NaN,United States,NaN,2013,TV-Y7-FV,1 Season,Kids' TV,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,80058654,TV Show,Transformers: Robots in Disguise,NaN,United States,NaN,2016,TV-Y7,1 Season,Kids' TV,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,80125979,Movie,#realityhigh,Fernando Lebrija,United States,NaN,2017,TV-14,99 min,Comedies,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [74]:
# title column의 정보를 보자
table1['title']

0           Norm of the North: King Sized Adventure
1                        Jandino: Whatever it Takes
2                                Transformers Prime
3                  Transformers: Robots in Disguise
4                                      #realityhigh
                           ...
6226                                   Red vs. Blue
6227                                          Maron
6228         Little Baby Bum: Nursery Rhyme Friends
6229    A Young Doctor's Notebook and Other Stories
6230                                        Friends
Name: title, Length: 6231, dtype: object

In [17]:
#테이블에 품목당 100개당 재고율을 추가해보자.
# table1['buying_rate']= (table1['unit_stock']-table1['unit'])*0.01
# table1

In [18]:
# buying_rate 을 제거한다. axis = 0은 열, axis = 1은 행을 의미, inplace는 기존 객체를 수정할지 말지의 여부를 결정.
# table1.drop(labels = 'cast', axis = 1, inplace = True)
# table1.head()

In [19]:
# 특정 행을 찾는기능
table1.loc[3]

show_id                                                  80058654
type                                                      TV Show
title                            Transformers: Robots in Disguise
director                                                      NaN
country                                             United States
Unnamed: 5                                                    NaN
release_year                                                 2016
rating                                                      TV-Y7
duration                                                 1 Season
listed_in                                                Kids' TV
description     When a prison ship crash unleashes hundreds of...
Unnamed: 11                                                   NaN
Unnamed: 12                                                   NaN
Unnamed: 13                                                   NaN
Unnamed: 14                                                   NaN
Unnamed: 15                                                   NaN
Unnamed: 16                                                   NaN
Unnamed: 17                                                   NaN
Unnamed: 18                                                   NaN
Unnamed: 19                                                   NaN
Unnamed: 20                                                   NaN
Unnamed: 21                                                   NaN
Unnamed: 22                                                   NaN
Unnamed: 23                                                   NaN
Unnamed: 24                                                   NaN
Unnamed: 25                                                   NaN
Name: 3, dtype: object

In [20]:
# 특정 행의 특정 열을 찾는 기능.
table1.loc[3, 'title']

'Transformers: Robots in Disguise'

In [21]:
table1.loc[[1,7,10], ['country', 'title']]

           country                               title
1   United Kingdom          Jandino: Whatever it Takes
7            Chile  Fabrizio Copano: Solo pienso en mi
10             NaN         Joaqu챠n Reyes: Una y no m찼s

In [22]:
# price_per_unit의 가격이 5달러이상이고 unit이 45이상인 값들의 리스트를 불러오자.
# table1[(table1['price_per_unit'] > 5) & (table1['unit'] > 45)] #and
# table1[(table1['price_per_unit'] > 5) | (table1['unit'] > 45)] #or

In [33]:
#index로 지정하고 싶은 column을 설정해보자.
table1.set_index('rating')
table1.head()

AttributeError: 'Series' object has no attribute 'set_index'

In [36]:
# index값을 원래대로 되돌려놓자.
table1.reset_index()
table1.head()

0    Norm of the North: King Sized Adventure
1                 Jandino: Whatever it Takes
2                         Transformers Prime
3           Transformers: Robots in Disguise
4                               #realityhigh
Name: title, dtype: object

In [15]:
import numpy as np
import pandas as pd
table2=pd.read_csv('C:/Users/Administrator/jupyter/stationery.csv')
table2.head()
# 특정 열에 NaN일때 value = 0으로 숫자를 집어 넣어준다.
table2.fillna(0)
# 특정 행에 0을 집어넣자.
table2.loc[1] = 0

table2.head()

,date,place,name,product_name,unit_stock,unit,price_per_unit,totla_price
0,5/14/2020,Central,Gill,Pencil,100.0,53,1.29,68.37
1,0,0,0,0,0.0,0,0.00,0
2,7/4/2020,East,Jones,Pen Set,100.0,62,4.99,309.38
3,7/21/2020,Central,Morgan,Pen Set,100.0,55,12.49,686.95
4,8/24/2020,West,Sorvino,Desk,100.0,3,275.00,825

In [16]:
# 'place'를 그룹핑하여 만든 by_place의 생김새를 관찰해보자. 
by_place = table2.groupby('place')
by_place.describe()
by_place.fillna(0)

# 특정 column의 생김새만 관찰해보자.
by_place.describe()['unit']

         count   mean        std   min    25%   50%   75%   max
place
0          1.0   0.00        NaN   0.0   0.00   0.0   0.0   0.0
Central    4.0  33.25  24.005208  11.0  13.25  33.5  53.5  55.0
East       1.0  62.00        NaN  62.0  62.00  62.0  62.0  62.0
West       2.0  30.00  38.183766   3.0  16.50  30.0  43.5  57.0

In [17]:
# by_place의 평균
by_place.mean()

         unit_stock   unit  price_per_unit
place
0               0.0   0.00           0.000
Central       100.0  33.25           5.015
East          100.0  62.00           4.990
West          100.0  30.00         147.495

In [18]:
# place column의 값들의 항목을 알아보자
table2['place'].unique()

array(['Central', 0, 'East', 'West'], dtype=object)

In [19]:
# 위의 항목들의 개수를 알아보자.
table2['place'].nunique()

4

In [20]:
# 각 항목들의 개수를 알아보자.
table2['place'].value_counts()

Central    4
West       2
East       1
0          1
Name: place, dtype: int64

In [21]:
# Place가 Central인 놈들의 값들로만 테이블(table2)을 만들어보자.
Central_df = table2[table2['place'] == 'Central']
Central_df.head()

,date,place,name,product_name,unit_stock,unit,price_per_unit,totla_price
0,5/14/2020,Central,Gill,Pencil,100.0,53,1.29,68.37
3,7/21/2020,Central,Morgan,Pen Set,100.0,55,12.49,686.95
6,10/31/2020,Central,Andrews,Pencil,100.0,14,1.29,18.06
7,11/17/2020,Central,Jardine,Binder,NaN,11,4.99,54.89

In [22]:
# table1을 price_per_unit column의 값들을 오름차순으로 정렬해보자.
table2.sort_values(by = 'price_per_unit', ascending = False)
table2.head()

,date,place,name,product_name,unit_stock,unit,price_per_unit,totla_price
0,5/14/2020,Central,Gill,Pencil,100.0,53,1.29,68.37
1,0,0,0,0,0.0,0,0.00,0
2,7/4/2020,East,Jones,Pen Set,100.0,62,4.99,309.38
3,7/21/2020,Central,Morgan,Pen Set,100.0,55,12.49,686.95
4,8/24/2020,West,Sorvino,Desk,100.0,3,275.00,825

In [23]:
table2['unit'].apply(np.sqrt)

0    7.280110
1    0.000000
2    7.874008
3    7.416198
4    1.732051
5    7.549834
6    3.741657
7    3.316625
Name: unit, dtype: float64

In [33]:
#  파일을 불러오자.
# a = pd.read_csv('filename')
#  파일을 저장해보자. (index 판별은 index값을 저장할 것인지 값만 저장할 것인지 결정.)
# table2.to_csv('stationery1.csv', index = True)
#  excel file의 특정sheet를 불러오자.
# b = pd.read_excel('filename', sheet_name = 'sheet1')
#  excel file의 특정sheet를 저장하자.
# b.to_excel('filename', sheet_name = 'sheet1')
#  html의 데이터를 불러와보자.
# c = pd.read_html('URL')
# c[0].head()

,date,place,name,product_name,unit_stock,unit,price_per_unit,totla_price
0,5/14/2020,Central,Gill,Pencil,100.0,53,1.29,68.37
1,0,0,0,0,0.0,0,0.00,0
2,7/4/2020,East,Jones,Pen Set,100.0,62,4.99,309.38
3,7/21/2020,Central,Morgan,Pen Set,100.0,55,12.49,686.95
4,8/24/2020,West,Sorvino,Desk,100.0,3,275.00,825
5,10/14/2020,West,Thompson,Binder,NaN,57,19.99,"1,139.43"
6,10/31/2020,Central,Andrews,Pencil,100.0,14,1.29,18.06
7,11/17/2020,Central,Jardine,Binder,NaN,11,4.99,54.89

In [25]:
# fillna(method='ffill'or'pad') = NaN값을 바로 위의 데이터로 처리한다.
# fillna(method='bfill'or'backfill') = NaN값을 바로 밑의 데이터로 처리한다.
table2.rename(columns={'place':'장소'})
# 해당 데이터프레임의 행열 형태를 알고싶다!!
# table2.shape

,date,place,name,product_name,unit_stock,unit,price_per_unit,totla_price
0,5/14/2020,Central,Gill,Pencil,100.0,53,1.29,68.37
1,0,0,0,0,0.0,0,0.00,0
2,7/4/2020,East,Jones,Pen Set,100.0,62,4.99,309.38
3,7/21/2020,Central,Morgan,Pen Set,100.0,55,12.49,686.95
4,8/24/2020,West,Sorvino,Desk,100.0,3,275.00,825
5,10/14/2020,West,Thompson,Binder,NaN,57,19.99,"1,139.43"
6,10/31/2020,Central,Andrews,Pencil,100.0,14,1.29,18.06
7,11/17/2020,Central,Jardine,Binder,NaN,11,4.99,54.89

In [26]:
# 두 가지 기준의 값으로 pivot_table을 짜보자.
table2.pivot_table(values = 'unit', index = ['product_name','place'])

                      unit
product_name place
0            0         0.0
Binder       Central  11.0
             West     57.0
Desk         West      3.0
Pen Set      Central  55.0
             East     62.0
Pencil       Central  33.5

In [ ]:
# 직업별 평균 나이를 세고, 22세 이상만 필터링하고, 나이순으로 정렬한 결과 생성
# query 메서드는 조건식을 문자열로 입력받아 해당 조건에 만족하는 행을 추출해 출력해주는 함수이다. - 성능의 우위를 위해 만들어짐.
df.group_ny('직업').agg({'나이':np.mean}).query('나이>22').sort_values('나이', ascending=False)\
.plot(kind='bar')

In [35]:
# 글씨체를 바꿔보자.
import matplotlib.pyplot as plt
plt.rcParams['font.family'] = 'AppleGothic'